# DisplayedEndStation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..DisplayedEndStation Property
Alignment Class See Also
---
Specifies the station at which the alignment's display ends, in Revit internal model units (standard Imperial feet).
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public double DisplayedEndStation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DisplayedEndStation As Double
	Get
```

Visual C++
---
```text
public:
property double DisplayedEndStation {
	double get ();
}
```

# Remarks
This station is within the alignment's geometric definition range (StartStation, EndStation).
# See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace